/*
Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
456 -> 5
782 -> 8
918 -> 1
*/

/*
int CutNumber(int num)
{
    int result = num / 10 % 10;

    return result;
}

Console.Write("Введите трехзначное число: ");
int a = Convert.ToInt32(Console.ReadLine());
int res = CutNumber(a);
Console.WriteLine(res);
*/