/*
Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
a = 5; b = 7 -> max = 7
a = 2 b = 10 -> max = 10
a = -9 b = -3 -> max = -3
*/

/*
Console.Write("Input the first number to compare: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write("Input the second number to compare: ");
int b = Convert.ToInt32(Console.ReadLine());

int max = b;

if(a > b)
{
    max = a;
}
    
Console.WriteLine($"Max number = {max}");
*/