/* Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
645 -> 5
78 -> третьей цифры нет
32679 -> 6
*/

/*
int TrirdNum(int num)
{ 
    while(num > 1000)
        
        {
            num = num / 10;
        }
        
    int b = num % 10;

    return b;
}

Console.Write("Ведите число, чтобы узнать третью цифру слева от заданного числа: ");
int a = Convert.ToInt32(Console.ReadLine());

if(a >= 100)
{
    Console.WriteLine(TrirdNum(a));
}
else
{
    Console.WriteLine("Третьей цифры нет");
}
*/