/*
Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
6 -> да
7 -> да
1 -> нет
*/

/*
bool WeekNum(int num)
{
    if (num <= 5)
    {
        return false;
    }
    else
    {
        return true;
    }
}

Console.Write("Введите число от 1 до 7(дни недели), чтобы узнать, является ли этот день выходным: ");
int a = Convert.ToInt32(Console.ReadLine());

if (a > 7)
{
    Console.WriteLine("В недели только 7 дней!");
}
else
{
    Console.WriteLine(WeekNum(a));
}

*/